Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/G63A.tmx
Source language: en_us
Languages: zh_cn

source: Harriet Tubman became famous as a "conductor" on the Underground Railroad during the turbulent 1850s.
zh_cn: 在动荡的19世纪50年代，Harriet Tubman成为了地下铁路的一个著名“售票员”。

source: Born a slave on Maryland's eastern shore, she endured brutal beatings by her master and the harsh regime of the field hand. Her life was a testimony to the fierce resistance of African-American people to slavery.
zh_cn: 她出生为马里兰州东海岸的一个奴隶，承受了她主人残酷的鞭打和严酷的农业人员阶级体制，她的一生都是非洲裔美国人对奴隶制顽强抵抗的见证。

source: In 1849 Tubman fled Maryland, leaving behind her free husband of five years, John Tubman, and her parents, sisters, and brothers.
zh_cn: 1849年Tubman抛弃了她拥有自由身、结婚五年的丈夫，还有她的父母、姐妹和兄弟，只身逃离马里兰州。

source: "Mah people mus' go free," her constant refrain, suggests a determination uncommon among even the most militant slaves.
zh_cn: 她的口头禅“我的人民必须获得自由”表现出一种非凡的决心，这在大多数激进的努力中都是少见的。

source: She returned to the South at least nineteen times to lead her family and hundreds of other slaves to freedom via the Underground Railroad.
zh_cn: 她至少19次回到南方来，带领她的家人和数百其他奴隶从地下铁路获得自由。

source: Utilizing her native intelligence and drawing on her boundless courage, she eluded bounty hunters seeking a reward for her capture, which eventually went as high as forty thousand dollars.
zh_cn: 她运用她天生的智慧和靠着她无限的勇气，躲避了为了奖赏而追捕她的赏金猎人，而她的赏金逐渐升高到四万美元。

source: She never lost a fugitive or allowed one to turn back.
zh_cn: 她从来没有丢过一个避难者，也从来没有允许过一个转身回去。

source: Two things sustained her: the pistol at her side and her faith in God.
zh_cn: 她靠两样东西维持着这样的生活：她身旁的手枪和她对上帝的信仰。

source: She would not hesitate to use the pistol in self-defense, but it was also a symbol to instruct slaves, making it clear that "dead Negroes tell no tales."
zh_cn: 她不会犹豫用手枪来进行自我防卫，但它也是一个用来教育奴隶的象征物，表明“死掉的黑人是不会有发言权的。”

source: Timid slaves seemed to find courage in her presence; no one ever betrayed her.
zh_cn: 温和的奴隶们似乎能从她的存在中找到勇气，从来没有人背叛过她。

source: She affirmed her faith in God in her statement, "I always tole God, I'm gwine to hole stiddy on to you, an' you've got to see me trou [through]."
zh_cn: 她在她的申明中确证了她对上帝的信仰：“我总是告诉上帝，我会紧紧地守住对你的信仰，而你也要保佑我度过这一切。”

source: Tubman collaborated with John Brown in 1858 in planning his raid on Harpers Ferry.
zh_cn: 1858年，Tubman和John Brown合作策划了他对Harpers渡轮的突袭。

source: The two met in Canada where she told him all she knew of the Underground Railroad in the East.
zh_cn: 他们两个是在加拿大碰面的，在那里她告诉了他一切她所知的东边地下铁路的信息。

source: Advising him on the area in which he planned to operate, she promised to deliver aid from fugitives in the region.
zh_cn: Tubman在Brown准备起事的地区给了他一些建议，她还答应让该地区的避难者提供援助。

source: Brown's admiration for her was immeasurable, and he wanted her to accompany him on the raid.
zh_cn: Brown对她的钦佩不可估量，他希望她能在突袭中陪伴他。

source: Tubman planned to be present but was ill at the time and could not participate.
zh_cn: Tubman原本计划出现在突袭中，但是在那是生病了无法参加。

source: Tubman's resistance to slavery did not end with the outbreak of the Civil War. Her services as nurse, scout, and spy were solicited by the Union government.
zh_cn: Tubman对奴隶制的抵抗并没有随着南北战争的爆发而结束，联邦政府需要她作为一个护士、侦查员和间谍的服务。

source: For more than three years she nursed the sick and wounded in Florida and the Carolinas, tending whites and blacks, soldiers and contrabands.
zh_cn: 她在佛罗里达和卡罗莱纳医护生病和受伤人员超过三年，照顾着白人、黑人、士兵和逃难到联邦政府一方的奴隶。

source: Tubman was a short woman without distinctive features. With a bandanna on her head and several front teeth missing, she moved unnoticed through rebel territory. This made her invaluable as a scout and spy under the command of Col. James Montgomery of the Second Carolina Volunteers.
zh_cn: Tubman是一个身材短小没有明显体貌特征的女人，她头上包着印花大手帕，嘴里缺了几颗牙，在反动的地区里行走不会被人注意，这使她成为第二卡罗莱纳志愿军的James Montgomery上校手下一名无价的侦查员和间谍。

source: As leader of a corps of local blacks, she made several forays into rebel territory, collecting information.
zh_cn: 作为当地黑军团的领导人，她多次突袭反动地区收集情报。

source: Armed with knowledge of the location of cotton warehouses, ammunition depots, and slaves waiting to be liberated, Colonel Montgomery made several raids in southern coastal areas.
zh_cn: 了解了棉花仓库、武器存放点和等待被解放的奴隶的位置后，Montgomery上校对南方海岸地区发动了多次突袭。

source: Tubman led the way on his celebrated expedition up the Combahee River in June 1863.
zh_cn: 1863年六月他开始了他著名的沿Combahee河而上的远征时，是Tubman在带路。

source: For all of her work, Tubman was paid only two hundred dollars over a three-year period and had to support herself by selling pies, gingerbread, and root beer.
zh_cn: 作为她这些工作的回报，Tubman只收到了三年间支付的200美元，并不得不通过售卖派、姜饼和根汁汽水来维持生计。

source: After the war, Tubman returned to Auburn, New York, and continued to help blacks forge new lives in freedom.
zh_cn: 在战争之后，Tubman回到了纽约Auburn，继续帮助黑人在自由中塑造新生活。

source: She cared for her parents and other needy relatives, turning her residence into the Home for Indigent and Aged Negroes.
zh_cn: 她照顾她的父母和其他需要帮助的亲戚，将自己的住所变成了“贫困和老年黑人之家”。

source: Lack of money continued to be a pressing problem, and she financed the home by selling copies of her biography and giving speeches.
zh_cn: 缺钱仍然是一个迫切的问题，于是她通过销售自己的自传和发表演说来为“贫困和老年黑人之家”提供资金。

source: Her most memorable appearance was at the organizing meeting of the National Association of Colored Women in 1896 in Washington, D.C. Two generations came together to celebrate the strength of black women and to continue their struggle for a life of dignity and respect.
zh_cn: 她最为人铭记的一次现身是在1896年华盛顿特区的国家有色女性委员会的组建大会上，两代人聚到一起来庆祝黑人女性的力量，来继续她们为了获得尊严和尊重的一生而进行的奋斗。

source: Harriet Tubman, the oldest member present, was the embodiment of their strength and their struggle.
zh_cn: Harriet Tubman是当时在场的最老的成员，也是她们的力量和奋斗的化身。
